'==========================================================================================================================================
' File   : UTIL プロシージャ
' Author : T.tsutsui
' Date   : 2020/05/27
' Purpose: 汎用関数を定義
'==========================================================================================================================================
Option Explicit

'---------------------------------------------------------------------------------------
' Method : デバッグ関数
' Author : T.tsutsui
' Date   : 2018/08/28
' Purpose: デバッグ用の処理を記述
'---------------------------------------------------------------------------------------
Sub DBG(value As String)
    Debug.Print Date; Time(); " : " + value
End Sub


'---------------------------------------------------------------------------------------
' Method : オブジェクト削除
' Author : T.tsutsui
' Date   :
' Purpose:
'---------------------------------------------------------------------------------------
Sub オブジェクト削除()
    Dim delOb As Object
    For Each delOb In Worksheet("MAIN").Object
    
End Sub

'---------------------------------------------------------------------------------------
' Method :
' Author :
' Date   :
' Purpose:
'---------------------------------------------------------------------------------------
Sub 図形を回さずアクティブシート上の図形を一括削除する()
  ActiveSheet.Shapes.SelectAll
  Selection.Delete

End Sub

'---------------------------------------------------------------------------------------
' Method :
' Author :
' Date   :
' Purpose:
'---------------------------------------------------------------------------------------
Sub アクティブブックの全ワークシートの図形を一括削除する()
  Dim ws As Worksheet
  Dim shp As Shape

  For Each ws In ActiveWorkbook.Worksheets

    For Each shp In ws.Shapes
      shp.Delete
    Next shp

  Next ws

End Sub


'---------------------------------------------------------------------------------------
' Method :
' Author :
' Date   :
' Purpose:
'---------------------------------------------------------------------------------------
Sub アクティブシート上の図形を一括削除する()
  Dim shp As Shape

  For Each shp In ActiveSheet.Shapes
    shp.Delete
  Next shp

End Sub





